export const DIALOGUES = {
    SUBWAY_APOLOGY: [
        "……",
        "第一次见你，你扎着马尾、穿着白色大褂，",
        "笑起来真的很好看。",
        "所以我找了个蹩脚的借口加了你微信。",
        "后来我们聊了很多，发现好多共同爱好，",
        "一起吃饭、散步、在地铁口坐下聊天……",
        "你真的是一个很好很好的人。",
        "可是……是我把这一切都弄砸了。",
        "我好几次以眼镜不舒服当借口，",
        "可那真的只是想和你说话的借口。",
        "我没站在你的角度想过——",
        "你会以为是自己做得不好。",
        "分开的时候，我说了好多伤你的话，",
        "可是真的没有几句是真心话，我太想赢了，结果是输的更惨了。",
        "你说这是第一次和男生接触就遇到我这样的人，",
        "……我知道，这对你太不公平了。",
        "对不起。",
        "所有的道歉和解释在事实面前都是那么无力，",
        "如果你愿意，这个游戏最后有一份礼物给你。",
        "还是希望你可以原谅我，",
        "因为我发现，我内心的愧疚感要远大于失去你的感觉"
    ],
    CHOICES: {
        REJECT: "不原谅",
        ACCEPT: "原谅"
    },
    ENDING_A_LETTER:
        "谢谢你的原谅。\n" +
        "我知道这两个字对我来说太奢侈了。\n" +
        "但我会把这份善意好好收着，\n" +
        "去变成一个值得被原谅的人。\n" +
        "愿你以后遇到的人都温柔待你，\n" +
        "就像你本该被对待的那样。\n" +
        "祝你天天开心。\n" +
        "这个礼物我想你应该会喜欢，\n" +
        "记得有一次你跟我说起过，\n" +
        "在你眼里好像就没有缺点，哪里都好，\n" +
        "加上你也很喜欢拍照。\n" +
        "那时我就加入购物车了，\n" +
        "想着等你六月过生日的时候送给你，\n" +
        "可惜后面发生了那些事……\n" +
        "但想着你五一不是会去看演唱会嘛，\n" +
        "所以就想着以这种方式把东西送给你，\n" +
        "顺便表达我的歉意。",
    ENDING_A_REDEEM_METHOD: "微信领取（补药拉黑我了，球球你了）",
    ENDING_A_REDEEM_CODE: "TKS_2_SHONA_HE",
    ENDING_B_LETTER:
        "谢谢你可以玩到这里。\n" +
        "我不奢求你的原谅，\n" +
        "只是想让你知道——\n" +
        "你不是做得不好，\n" +
        "从头到尾，不好的人是我。\n" +
        "愿你以后遇到的人都比我好，\n" +
        "祝你天天开心（真心的）。\n" +
        "这个礼物我想你应该会喜欢，\n" +
        "记得有一次你跟我说起过，\n" +
        "在你眼里好像就没有缺点，哪里都好，\n" +
        "加上你也很喜欢拍照。\n" +
        "那时我就加入购物车了，\n" +
        "想着等你六月过生日的时候送给你，\n" +
        "可惜后面发生了那些事……\n" +
        "但想着你五一不是会去看演唱会嘛，\n" +
        "所以就想着以这种方式把东西送给你，\n" +
        "顺便表达我的歉意。",
    ENDING_B_REDEEM_METHOD: "微信领取（补药拉黑我了，球球你了）",
    ENDING_B_REDEEM_CODE: "TKS_2_SHONA_BE",
} as const;
