export const IDLE_CHATS = {
    player: [
        '地上有星星。',
        '我真该死啊。',
        '可以原谅我吗？',
        '和你散步真的很开心！',
        '今天晚上的月亮真好看。',
        '你有没有觉得这条路走不完？',
        '对不起，我真诚的道歉。',
        '要是能一直这样走就好了。',
    ],
    npc: [
        '我讨厌番茄味的食物。',
        '我喜欢拍好看的照片。',
        '讨厌无理取闹的客人。',
        '你知道吗？我会定期去采购零食。',
        '讨厌周六去海珠区的医院工作。',
        '今天的月亮好圆。',
        'V你50块。',
        '路灯把影子拉得好长。',
        '今天的云好好看。',
        '星星好多。',
        '走慢一点吧。',
        '走快一点吧。'
    ],
} as const;
